CSA Application/app/controllers/users_controller.rb

  def index
    if is_admin?
      @users = User.paginate(page: params[:page],
                             per_page: params[:per_page])
                   .order('surname, firstname')
---
SELECT "users".* FROM "users" ORDER BY surname, firstname LIMIT 8 OFFSET 0

  def create
    @user = User.new(user_params)

    # Only create a new image if the :image_file parameter
    # was specified
    @image = Image.new(photo: params[:image_file]) if params[:image_file]

    # The ImageService model wraps up application logic to
    # handle saving images correctly
    @service = ImageService.new(@user, @image)

    respond_to do |format|
      if @service.save # Will attempt to save user and image
---
INSERT INTO "users" ("created_at", "email", "firstname", "grad_year", "phone", "surname", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 980190962]]

  def set_user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "980190962"]]