app/controllers/broadcasts_controller.rb

  def index
    @broadcasts = Broadcast.paginate(page: params[:page],
                                     per_page: params[:per_page])
                           .order('created_at DESC')
---
SELECT  "broadcasts".* FROM "broadcasts"   ORDER BY created_at DESC LIMIT 8 OFFSET 0

  def create

    @broadcast = Broadcast.new(broadcast_params)

    # Wire up broadcast with the current user (an administrator)
    # Will be an admin user (see before_filter)
    # Note the current_user is a user_detail object so we need
    # to navigate to its user object
    @broadcast.user = current_user.user

    # Doing the next line forces a save automatically. I want to defer this
    # until the "if" statement
    #current_user.user.broadcasts << @broadcast

    no_errors = false
    respond_to do |format|
      if @broadcast.save
---
INSERT INTO "broadcasts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "Hello There"], ["created_at", "2014-12-03 17:59:56.970802"], ["updated_at", "2014-12-03 17:59:56.970802"], ["user_id", 1]]

  def destroy
    @broadcast.destroy
---
DELETE FROM "broadcasts" WHERE "broadcasts"."id" = ?  [["id", 980190962]]

  def set_broadcast
    @broadcast = Broadcast.find(params[:id])
---
SELECT  "broadcasts".* FROM "broadcasts"  WHERE "broadcasts"."id" = ? LIMIT 1  [["id", 980190962]]